visionspacetec/VST104-Testing/VST104-Testing/VST104-Testing.ioc
#MicroXplorer Configuration settings - do not modify
PF7.GPIOParameters=GPIO_Label
VP_RCC_LSE.Signal=RCC_LSE
VP_RCC_LSE.Mode=CRS SYNC Source LSE
RCC.USART1Freq_Value=64000000
USART2.IPParameters=VirtualMode-Asynchronous,Parity,Mode,BaudRate
SPI1.VirtualType=VM_MASTER
ADC2.SamplingTime-1\#ChannelRegularConversion=ADC_SAMPLETIME_2CYCLES_5
PB10.Mode=I2C
PG8.Signal=I2C3_SDA
PG8.Locked=true
PD8.Locked=true
PC3.Locked=true
PA3.GPIOParameters=GPIO_Label
PC15-OSC32_OUT\ (PC15).Mode=LSE-External-Oscillator
PB3\ (JTDO/TRACESWO).GPIOParameters=GPIO_Label
PD6.GPIO_Label=UART2_RX
PA2.GPIOParameters=GPIO_Label
PG2.GPIOParameters=GPIO_Label
PinOutPanel.RotationAngle=0
PF6.GPIO_Label=QSPI_BK1_IO3
RCC.MCO1PinFreq_Value=64000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
PC14-OSC32_IN\ (PC14).Mode=LSE-External-Oscillator
USART3.VirtualMode-Asynchronous=VM_ASYNC
RCC.LPTIM1Freq_Value=64000000
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA14\ (JTCK/SWCLK).Signal=SYS_JTCK-SWCLK
PF7.Signal=QUADSPI_BK1_IO2
I2C4.Timing=0x10707DBC
SPI1.Direction=SPI_DIRECTION_2LINES
RCC.I2C4Freq_Value=64000000
RCC.APB2TimFreq_Value=64000000
PB6.Signal=CAN2_TX
PB6.Mode=CAN_Activate
SPI1.CalculateBaudRate=32.0 MBits/s
PC3.Signal=ADCx_IN4
RCC.SAI2Freq_Value=64000000
PD8.Signal=USART3_TX
QUADSPI.FlashSize=31
PF10.GPIO_Label=QSPI_CLK
RCC.USART3Freq_Value=64000000
ProjectManager.ProjectBuild=false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA0.Locked=true
PA4.Locked=true
PC1.GPIO_PuPd=GPIO_PULLUP
PB12.GPIO_Label=I2C4_EN
ProjectManager.FirmwarePackage=STM32Cube FW_L4 V1.17.0
MxDb.Version=DB.6.0.20
PA13\ (JTMS/SWDIO).GPIO_Label=SW_DIO
PA1.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=false
PC4.GPIO_Label=SPI1_CS1
SPI1.DataSize=SPI_DATASIZE_8BIT
PF10.Locked=true
PF8.Mode=Single Bank 1
PA14\ (JTCK/SWCLK).Mode=Trace_Asynchronous_SW
RCC.PLLRCLKFreq_Value=64000000
SH.ADCx_IN4.ConfNb=2
PB6.Locked=true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA13\ (JTMS/SWDIO).Locked=true
ProjectManager.HalAssertFull=false
PA0.Signal=GPIO_Output
Mcu.Package=LQFP144
PB9.Signal=CAN1_TX
PF8.GPIOParameters=GPIO_Label
PA5.Locked=true
PD5.GPIOParameters=GPIO_Label
PA14\ (JTCK/SWCLK).Locked=true
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
ADC2.Channel-1\#ChannelRegularConversion=ADC_CHANNEL_3
RCC.LSCOPinFreq_Value=32000
USART3.IPParameters=VirtualMode-Asynchronous,Parity,Mode
PA10.Signal=GPIO_Output
RCC.DFSDMFreq_Value=64000000
PF7.Locked=true
PA14\ (JTCK/SWCLK).GPIO_Label=SW_CLK
RCC.PLLPoutputFreq_Value=64000000
RCC.APB1TimFreq_Value=64000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.LPUART1Freq_Value=64000000
PF10.Mode=Single Bank 1
PD5.Locked=true
CAN1.CalculateTimeBit=1250.00
PH0-OSC_IN\ (PH0).Mode=HSE-External-Clock-Source
PA4.GPIO_Label=SPI1_CS2
ProjectManager.CustomerFirmwarePackage=
PC4.GPIOParameters=GPIO_Label
RCC.HSI48_VALUE=48000000
CAN1.CalculateTimeQuantum=250.0
PA5.Mode=Full_Duplex_Master
PD6.GPIOParameters=GPIO_Label
CAN2.CalculateBaudRate=800000
RCC.PLLQoutputFreq_Value=64000000
ProjectManager.ProjectFileName=VST104-Testing.ioc
PC15-OSC32_OUT\ (PC15).GPIO_Label=OSC32_OUT
PD9.GPIO_Label=UART3_RX
Mcu.PinsNb=48
ADC1.IPParameters=Rank-1\#ChannelRegularConversion,master,Channel-1\#ChannelRegularConversion,SamplingTime-1\#ChannelRegularConversion,OffsetNumber-1\#ChannelRegularConversion,NbrOfConversionFlag,ClockPrescaler
PA9.GPIO_Label=TEST2
CAN1.IPParameters=CalculateTimeQuantum,CalculateTimeBit,CalculateBaudRate,BS1,BS2
RCC.SWPMI1Freq_Value=64000000
CAN1.CalculateBaudRate=800000
CAN2.IPParameters=CalculateTimeQuantum,CalculateTimeBit,CalculateBaudRate,BS1,BS2
PC2.Signal=ADCx_IN3
PD7.Signal=GPIO_Output
PC0.Signal=GPIO_Output
PD6.Mode=Asynchronous
QUADSPI.IPParameters=FlashSize
USART2.BaudRate=115200
PC14-OSC32_IN\ (PC14).GPIO_Label=OSC32_IN
PF8.GPIO_Label=QSPI_BK1_IO0
PC3.GPIOParameters=GPIO_Label
PD10.Signal=GPIO_Output
PF1.Mode=I2C
PB11.Mode=I2C
ADC2.IPParameters=Rank-1\#ChannelRegularConversion,Channel-1\#ChannelRegularConversion,SamplingTime-1\#ChannelRegularConversion,OffsetNumber-1\#ChannelRegularConversion,NbrOfConversionFlag,ClockPrescaler
PA9.Signal=GPIO_Output
PB5.Locked=true
PB9.Locked=true
PD7.Locked=true
PD8.Mode=Asynchronous
RCC.PLLSAI1PoutputFreq_Value=64000000
Mcu.Pin46=VP_RCC_LSE
Mcu.Pin47=VP_SYS_VS_Systick
ADC2.OffsetNumber-1\#ChannelRegularConversion=ADC_OFFSET_NONE
PB10.Signal=I2C4_SCL
RCC.PLLSAI2RoutputFreq_Value=64000000
PA5.Signal=SPI1_SCK
Mcu.Pin40=PD7
Mcu.Pin41=PB3 (JTDO/TRACESWO)
Mcu.Pin44=PB8
Mcu.Pin45=PB9
Mcu.Pin42=PB5
Mcu.Pin43=PB6
ProjectManager.LastFirmware=true
Mcu.Pin37=PA14 (JTCK/SWCLK)
Mcu.Pin38=PD5
Mcu.Pin35=PA10
RCC.I2C1Freq_Value=64000000
Mcu.Pin36=PA13 (JTMS/SWDIO)
SPI1.Mode=SPI_MODE_MASTER
Mcu.Pin39=PD6
RCC.RNGFreq_Value=64000000
SH.ADCx_IN4.1=ADC2_IN4
PC2.GPIOParameters=GPIO_Label
Mcu.Pin30=PD14
PA1.GPIO_Label=QSPI_CS2
Mcu.Pin33=PG8
Mcu.Pin34=PA9
Mcu.Pin31=PG2
SH.ADCx_IN4.0=ADC1_IN4,IN4-Single-Ended
Mcu.Pin32=PG7
PA9.Locked=true
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.FreePins=false
RCC.LPTIM2Freq_Value=64000000
PF9.GPIOParameters=GPIO_Label
Mcu.Pin26=PB12
Mcu.Pin27=PD8
Mcu.Pin24=PB10
ProjectManager.UnderRoot=true
Mcu.Pin25=PB11
Mcu.Pin28=PD9
Mcu.Pin29=PD10
ADC1.SamplingTime-1\#ChannelRegularConversion=ADC_SAMPLETIME_2CYCLES_5
PD14.GPIOParameters=GPIO_Label
PA4.Signal=GPIO_Output
Mcu.Pin22=PA7
PB5.Signal=CAN2_RX
USART3.Mode=MODE_TX
Mcu.Pin23=PC4
Mcu.Pin20=PA5
ADC1.master=1
Mcu.Pin21=PA6
PA3.Locked=true
PD10.Locked=true
PA10.Locked=true
ADC2.NbrOfConversionFlag=1
NVIC.ForceEnableDMAVector=true
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
ADC1.Rank-1\#ChannelRegularConversion=1
ProjectManager.HeapSize=0x200
PA0.GPIOParameters=GPIO_Label
Mcu.Pin15=PA0
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PA1
Mcu.Pin13=PC2
PF8.Locked=true
Mcu.Pin14=PC3
PF10.GPIOParameters=GPIO_Label
Mcu.Pin19=PA4
PF6.Mode=Single Bank 1
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PA2
PF9.Signal=QUADSPI_BK1_IO1
Mcu.Pin18=PA3
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PC0
Mcu.Pin12=PC1
PB3\ (JTDO/TRACESWO).Mode=Trace_Asynchronous_SW
PB8.Mode=CAN_Activate
Mcu.Pin10=PH1-OSC_OUT (PH1)
PC3.GPIO_Label=EF1_CUR
RCC.PWRFreq_Value=64000000
RCC.I2C2Freq_Value=64000000
PC0.Locked=true
PC1.Signal=GPIO_Output
PB12.GPIOParameters=GPIO_Label
PD7.GPIOParameters=GPIO_Label
PA13\ (JTMS/SWDIO).Signal=SYS_JTMS-SWDIO
USART3.Parity=PARITY_EVEN
Mcu.Family=STM32L4
ProjectManager.MainLocation=Core/Src
PG8.Mode=I2C
I2C2.IPParameters=Timing
PA6.Mode=Full_Duplex_Master
PA14\ (JTCK/SWCLK).GPIOParameters=GPIO_Label
RCC.SAI1Freq_Value=64000000
RCC.CortexFreq_Value=64000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32L496ZGTx
PD9.GPIOParameters=GPIO_Label
PH0-OSC_IN\ (PH0).Signal=RCC_OSC_IN
PG2.Signal=GPIO_Output
PH0-OSC_IN\ (PH0).Locked=true
CAN2.CalculateTimeBit=1250.00
PG2.Locked=true
RCC.PLLSAI1RoutputFreq_Value=64000000
USART2.Parity=PARITY_EVEN
I2C2.Timing=0x10707DBC
PA0.GPIO_Label=QSPI_CS1
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_ADC1_Init-ADC1-false-HAL-true,4-MX_CAN1_Init-CAN1-false-HAL-true,5-MX_CAN2_Init-CAN2-false-HAL-true,6-MX_I2C2_Init-I2C2-false-HAL-true,7-MX_QUADSPI_Init-QUADSPI-false-HAL-true,8-MX_SPI1_Init-SPI1-false-HAL-true,9-MX_ADC2_Init-ADC2-false-HAL-true,10-MX_I2C3_Init-I2C3-false-HAL-true,11-MX_USART2_UART_Init-USART2-false-HAL-true,12-MX_USART3_UART_Init-USART3-false-HAL-true,13-MX_I2C4_Init-I2C4-false-HAL-true
PC0.GPIOParameters=GPIO_PuPd,GPIO_Label
PA9.GPIOParameters=GPIO_Label
PC0.GPIO_Label=SPI1_HOLD
PD6.Locked=true
RCC.USART2Freq_Value=64000000
PC1.Locked=true
PB11.Signal=I2C4_SDA
PD9.Mode=Asynchronous
ProjectManager.StackSize=0x400
RCC.I2C3Freq_Value=64000000
Mcu.IP4=I2C2
Mcu.IP5=I2C3
RCC.FCLKCortexFreq_Value=64000000
Mcu.IP2=CAN1
Mcu.IP3=CAN2
Mcu.IP0=ADC1
Mcu.IP1=ADC2
PC15-OSC32_OUT\ (PC15).GPIOParameters=GPIO_Label
SPI1.CLKPolarity=SPI_POLARITY_LOW
PF9.Locked=true
Mcu.UserConstants=
RCC.VCOSAI1OutputFreq_Value=128000000
PC1.GPIOParameters=GPIO_PuPd,GPIO_Label
RCC.SDMMCFreq_Value=64000000
Mcu.ThirdPartyNb=0
RCC.HCLKFreq_Value=64000000
SH.ADCx_IN3.0=ADC2_IN3,IN3-Single-Ended
Mcu.IPNb=14
ProjectManager.PreviousToolchain=
PF1.Locked=true
PD8.GPIOParameters=GPIO_Label
SH.ADCx_IN3.ConfNb=1
Mcu.Pin6=PF8
Mcu.Pin7=PF9
Mcu.Pin8=PF10
Mcu.Pin9=PH0-OSC_IN (PH0)
RCC.AHBFreq_Value=64000000
Mcu.Pin0=PC14-OSC32_IN (PC14)
Mcu.Pin1=PC15-OSC32_OUT (PC15)
PD5.Mode=Asynchronous
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PF0
Mcu.Pin3=PF1
Mcu.Pin4=PF6
PD10.GPIOParameters=GPIO_Label
Mcu.Pin5=PF7
I2C3.IPParameters=Timing
RCC.HSE_VALUE=26000000
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP10=SPI1
USART2.VirtualMode-Asynchronous=VM_ASYNC
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.IP12=USART2
Mcu.IP11=SYS
PF9.Mode=Single Bank 1
Mcu.IP13=USART3
PF7.GPIO_Label=QSPI_BK1_IO2
RCC.VCOInputFreq_Value=16000000
PB5.Mode=CAN_Activate
File.Version=6
PA10.GPIO_Label=TEST1
PB8.Locked=true
ProjectManager.ProjectName=VST104-Testing
PD7.GPIO_Label=I2C2_EN
PA6.Signal=SPI1_MISO
PA7.Locked=true
CAN2.BS1=CAN_BS1_2TQ
CAN2.BS2=CAN_BS2_2TQ
PD5.GPIO_Label=UART2_TX
ProjectManager.ToolChainLocation=
PD14.Locked=true
PA2.GPIO_Label=QSPI_CS3
RCC.LSI_VALUE=32000
PF8.Signal=QUADSPI_BK1_IO0
ADC1.OffsetNumber-1\#ChannelRegularConversion=ADC_OFFSET_NONE
PC14-OSC32_IN\ (PC14).Locked=true
I2C3.Timing=0x10707DBC
PC4.Locked=true
PF0.Signal=I2C2_SDA
PC0.GPIO_PuPd=GPIO_PULLUP
PD6.Signal=USART2_RX
SPI1.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_2
PC2.GPIO_Label=EF2_CUR
PG2.GPIO_Label=UART2_EN
PA3.Signal=GPIO_Output
PH1-OSC_OUT\ (PH1).GPIO_Label=OSC_EN
PA2.Locked=true
PB3\ (JTDO/TRACESWO).GPIO_Label=SW_0
RCC.MSI_VALUE=4000000
ADC2.ClockPrescaler=ADC_CLOCK_ASYNC_DIV4
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSI
PG7.Locked=true
PA7.Mode=Full_Duplex_Master
PG7.Signal=I2C3_SCL
PA13\ (JTMS/SWDIO).Mode=Trace_Asynchronous_SW
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler,DataSize,CLKPolarity
PC4.Signal=GPIO_Output
ProjectManager.DefaultFWLocation=true
PC15-OSC32_OUT\ (PC15).Signal=RCC_OSC32_OUT
PD9.Signal=USART3_RX
PD5.Signal=USART2_TX
PB12.Locked=true
ProjectManager.DeletePrevious=true
PB10.Locked=true
RCC.VCOSAI2OutputFreq_Value=128000000
PA13\ (JTMS/SWDIO).GPIOParameters=GPIO_Label
RCC.FamilyName=M
PH1-OSC_OUT\ (PH1).Signal=GPIO_Output
PD8.GPIO_Label=UART3_TX
PF7.Mode=Single Bank 1
PH1-OSC_OUT\ (PH1).GPIOParameters=GPIO_Label
CAN1.BS2=CAN_BS2_2TQ
PF6.Signal=QUADSPI_BK1_IO3
PB3\ (JTDO/TRACESWO).Locked=true
PB3\ (JTDO/TRACESWO).Signal=SYS_JTDO-SWO
CAN1.BS1=CAN_BS1_2TQ
ProjectManager.TargetToolchain=STM32CubeIDE
PF6.Locked=true
PB9.Mode=CAN_Activate
ADC1.Channel-1\#ChannelRegularConversion=ADC_CHANNEL_4
PC2.Locked=true
ProjectManager.RegisterCallBack=
PC15-OSC32_OUT\ (PC15).Locked=true
RCC.USBFreq_Value=64000000
PF9.GPIO_Label=QSPI_BK1_I1
PD10.GPIO_Label=UART3_EN
PG7.Mode=I2C
PA1.Signal=GPIO_Output
PH1-OSC_OUT\ (PH1).Locked=true
board=custom
RCC.VCOOutputFreq_Value=128000000
RCC.APB2Freq_Value=64000000
RCC.UART4Freq_Value=64000000
MxCube.Version=6.2.0
PF10.Signal=QUADSPI_CLK
RCC.PLLSAI1QoutputFreq_Value=64000000
RCC.ADCFreq_Value=64000000
PC1.GPIO_Label=SP1_WP
PA10.GPIOParameters=GPIO_Label
VP_SYS_VS_Systick.Mode=SysTick
CAN2.CalculateTimeQuantum=250.0
PD14.GPIO_Label=I2C3_EN
PA4.GPIOParameters=GPIO_Label
PF0.Locked=true
PF1.Signal=I2C2_SCL
RCC.UART5Freq_Value=64000000
RCC.IPParameters=ADCFreq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,CortexFreq_Value,DFSDMFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI48_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSI_VALUE,MCO1PinFreq_Value,MSI_VALUE,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PLLSAI1PoutputFreq_Value,PLLSAI1QoutputFreq_Value,PLLSAI1RoutputFreq_Value,PLLSAI2PoutputFreq_Value,PLLSAI2RoutputFreq_Value,PLLSourceVirtual,PWRFreq_Value,RNGFreq_Value,SAI1Freq_Value,SAI2Freq_Value,SDMMCFreq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART4Freq_Value,UART5Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USBFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAI1OutputFreq_Value,VCOSAI2OutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32L496Z(E-G)Tx
PA2.Signal=QUADSPI_BK1_NCS
Mcu.IP8=QUADSPI
Mcu.IP9=RCC
PD14.Signal=GPIO_Output
Mcu.IP6=I2C4
Mcu.IP7=NVIC
ProjectManager.CoupleFile=false
RCC.SYSCLKFreq_VALUE=64000000
PA1.Locked=true
RCC.PLLSAI2PoutputFreq_Value=64000000
KeepUserPlacement=false
PC14-OSC32_IN\ (PC14).Signal=RCC_OSC32_IN
PF0.Mode=I2C
PF6.GPIOParameters=GPIO_Label
RCC.HSI_VALUE=16000000
PC14-OSC32_IN\ (PC14).GPIOParameters=GPIO_Label
ADC1.NbrOfConversionFlag=1
PH0-OSC_IN\ (PH0).GPIO_Label=OSC_IN
ADC2.Rank-1\#ChannelRegularConversion=1
PA2.Mode=Single Bank 1
PB8.Signal=CAN1_RX
PD9.Locked=true
RCC.APB1Freq_Value=64000000
USART2.Mode=MODE_TX
ADC1.ClockPrescaler=ADC_CLOCK_ASYNC_DIV4
PB11.Locked=true
ProjectManager.DeviceId=STM32L496ZGTx
PB12.Signal=GPIO_Output
ProjectManager.LibraryCopy=1
I2C4.IPParameters=Timing
PA3.GPIO_Label=SPI1_CS3
PA7.Signal=SPI1_MOSI
PH0-OSC_IN\ (PH0).GPIOParameters=GPIO_Label
PA6.Locked=true
isbadioc=false
